sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
/*
 * Parcial.c
 *
 *  Created on: Jul 21, 2026
 *      Author: Sophia Alejandra Velásquez Fuentes - sovelasquezf@unal.edu.co
 *       Brief: Pantalla LDC con Joystick y RTC interno
 *
 *
 * Distribución de los Timers - Pines
 *
 *  - Comunicación Serial - AF07:
 *  	CH3 -> PA2: USART2_TX (Transmisión)
 *  	CH4 -> PA3: USART2_RX (Recepción)
 *
 *  - Conversión analogo-digital (Joystick):
 *  	X -> PA5: ADC1_5
 *  	Y -> PA6: ADC1_6
 *
 *  - I2C - AF04:
 *  	SCL -> PA8: I2C1_SCL
 *  	SDA -> PA9: I2C1_SDA
 *
 *  - Led OK (TIM4): PH1
 *
 * 	- MCO_1 - AF00: PA8
 *
 *
 * Descripción del Código
 *
 * El sistema realiza el sensado de las señales analógicas producidas por
 * un joystick (en X y Y), cuyos datos son visualizados una pantalla LCD
 * a través del bus I2C. La conversión de datos analógicos se gestiona
 * mediante el convertidor ADC1, mientras que el puerto serial USART2
 * permite la transmisión de comandos e información de estado. Adicional
 * a esto se usan otros 2 periféricos: el periférico RTC (Real-Time Clock)
 * para mostrar la fecha y hora y la salida de reloj MCO1 (Microcontroller
 * Clock Output) para monitorear las señales del HSI, LSE y PLL en el
 * microcontrolador.
 *
 * - Lectura Analógica y Normalización (ADC en PA5 y PA6): El ADC1 realiza
 * la conversión analógica-digital de dos canales para capturar la posición
 * del joystick en los ejes X e Y. El cálculo muestra las lecturas en un
 * rango de voltios (V) o en una escala normalizada (de -1.00 a 1.00).
 *
 * - Visualización e Interfaz (I2C en PB8 y PB9): La pantalla LCD actualiza
 * periódicamente la información mostrada. Esta expone la fecha, la hora,
 * datos de las lecturas normalizadas para X y Y y que señal está en la
 * salida del MCO1, ubicando cada dato en una línea respectiva de la pantalla.
 *
 * - Comunicación Serial (USART2 en PA2 y PA3): El periférico USART2 recibe
 * comandos desde la PC a 19200 bps, donde los caracteres H, L y P modifican
 * la señal en MCO1, F alterna el formato de hora en el display y J el formato
 * de visualización de la conversión ADC en el display y la terminal serial.
 * Además, por transmisión se muestra cada cambio significativo en las variables
 * actualiza los datos enviados por la interfaz serial.
 *
 * - Gestión de Tiempo en Tiempo Real (RTC): Se procesa la hora, minutos y
 * segundos del sistema para mantener un registro temporal continuo. Este
 * tiene como fuente el cristal LSE (32.768 kHz) y usa una bateria externa
 * que alimenta el resitro de Backup para mantener el conteo del tiempo sin
 * importar los reinicios del microcontrolador.
 *
 * - Salida de reloj (MCO1 en PA8): Se usa para direccionar y chequear las
 * señales de reloj presentes en el sistema, esta fuente se selecciona a
 * voluntad.
 *
 * En paralelo, el TIM11 genera por interrupción un parpadeo permanente de
 * seguridad en el pin PH1 cada 250 ms como muestra del funcionamiento
 * correcto de todo el sistema.
 *
 *
 */

#include <stm32f4xx_hal.h>
#include <stm32f4xx_hal_i2c.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>


TIM_HandleTypeDef htim11;				//TIM11 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

ADC_HandleTypeDef hadc1 = {0};			//ADC1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

I2C_HandleTypeDef hi2c1;				//I2C1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

UART_HandleTypeDef huart2 = {0};		//USART2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

RTC_HandleTypeDef hrtc;					//RTC handle debe ser global para que stm32f4xx_it.c pueda acceder a el


/*Dirección de la pantalla LCD*/
#define LCD_I2C_ADDR (0x22 << 1)

/*Posiciones de bits según el mapeo del PCF8574*/
#define LCD_RS         0x01		//P0
#define LCD_RW         0x02		//P1 (Se mantiene en 0 para poder escribir)
#define LCD_EN         0x04		//P2 (Comienza a escribir o leer datos)
#define LCD_BACKLIGHT  0x08		//P3 (Se mantiene en 1 para encender)

/*Direcciones base de cada línea (20x4)*/
#define LCD_LINE1  0x00		//Inicio línea A
#define LCD_LINE2  0x40		//Inicio línea B
#define LCD_LINE3  0x14		//Mitad de línea A (0x00 + 20 = 0x14)
#define LCD_LINE4  0x54		//Mitad de línea B (0x40 + 20 = 0x54)

/*Definiciones de RS: distinguen si se envía un comando o un dato al LCD*/
#define LCD_COMANDO  0
#define LCD_DATO     1

/*Contraseña o firma para la inicialización del RTC*/
#define RTC_BACKUP_PSW  1111		//Debe cambiarse para volver a configurar los valores del RTC sin quitar la alimentación externa


/*Variables*/
/*Mensaje inicial con las indicaciones para la recepción*/
uint8_t init_Msg[] =
"\r\n"
" Parcial - Sophia Velasquez\r\n"
"--------------------------------------------------------\r\n"
" Caracteres para la recepción:\r\n"
" 'H': Cambia la señal del MCO1 al HSI\r\n"
" 'L': Cambia la señal del MCO1 al LSE\r\n"
" 'P': Cambia la señal del MCO1 al PLL\r\n"
" 'F': Cambia el formato de la hora (Entre 12h y 24h)\r\n"
" 'J': Cambia el formato del Joystick (Normalizado y V)\r\n"
"--------------------------------------------------------\r\n"
"\r\n";

/*Variables usadas para la conversión ADC*/
volatile uint16_t raw_adc_x = 0;		//Almacena el valor de x para la conversión ADC
volatile uint16_t raw_adc_y = 0;		//Almacena el valor de y para la conversión ADC
volatile uint16_t adc_secuence = 0;		//Bandera para la secuencia en la conversión ADC (En 0: Conversión a hacer es x | En 1: Conversión a hacer es y)
volatile uint16_t adc_done = 0;			//Bandera para la conversión ADC
volatile uint32_t last_adc = 0;			//Valor para contabilizar la ultima conversión

/*Variable usadas para al comunicación serial*/
volatile uint8_t usart_done = 0;				//Bandera para la comunicación serial
volatile uint8_t rx_data = 0;					//Almacena el caracter recibido en la recepción
volatile uint8_t  joystick_formato = 0;			//En 0: Voltaje en V | En 1: Vector normalizado
char* mco_actual = "HSI";   					//Texto de la señal activa en MCO1

/*Variable usadas para comparar el esatdo actual del Joystick*/
volatile uint16_t actual_x = 0;		//Ultimo valor de X mostrado (para comparar cambios significativos)
volatile uint16_t actual_y = 0;  	//Ultimo valor de Y mostrado (para comparar cambios significativos)

/*Variables usadas para la transmisión del display*/
uint8_t lcd_backlight = LCD_BACKLIGHT;			//Controla el estado de la luz de fondo del LCD
volatile uint8_t update_display_flag = 0;		//Bandera para la actualización del LCD

/*Variable usadas para la actualización en pantalla del RTC*/
volatile uint8_t  rtc_formato = 0;   			//En 0: 24h | En 1: 12h
volatile uint8_t  rtc_ultimo_segundo = 60;		//Diferente a los valores que puede tomar segundos
RTC_TimeTypeDef hora_actual = {0};				//Almacen la hora en el sistema
RTC_DateTypeDef fecha_actual = {0};				//Almacena la fecha en el sistema

/*Mensaje completo donde se muestran los valores actuales del equipo a medida que se van actualizando*/
uint8_t msg_buffer[256];

/*Lineas a mostrar en el display*/
char lcd_linea0[21] = "Fecha: --/--/--";		//Buffer para la fila 0
char lcd_linea1[21] = "Hora: --:--:--";			//Buffer para la fila 1
char lcd_linea2[21] = "X:---- Y:----";			//Buffer para la fila 2
char lcd_linea3[21] = "MCO1: ---";				//Buffer para la fila 3


/*Implementación FSM*/
typedef enum{
	STATE_IDLE,             	//Verifica el cambio en algún periférico con las banderas o conteos
	STATE_READ_DATA,			//Lee valores y decide si se debe actualizar la pantalla
	STATE_UPDATE_DISPLAY		//Refresca en la pantalla los nuevos datos

} FSM_STATE;

