sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
FSM_STATE estado_actual = STATE_IDLE;


/*Prototipo de funciones privadas*/
static void SystemClock_Config(void);
static void gpio_Init(void);
static void tim11_led_ok_Init(void);
static void adc_Init(void);
static uint8_t adc_process(void);
static void i2c1_display_Init(void);
static void LCD_SendNibble(uint8_t nibble, uint8_t rs);
static void LCD_SendCommand(uint8_t comando);
static void LCD_Init(void);
static void LCD_SetCursor(uint8_t fila, uint8_t columna);
static void LCD_Print(char *texto);
static void LCD_Refresh(void);
static void usart2_Init(void);
static void command_process(void);
static void rtc_Init(void);
static void rtc_Initial_Setting(void);
static uint8_t rtc_process(void);
static void update_data(void);
static void mco1_Init(void);


int main(void){

	/*Inicialización de los bloques independientes*/
	HAL_Init();					//Inicializa HAL: SysTick, caché, agrupación de prioridades
	SystemClock_Config();		//Configura el árbol de relojes: HSI a 16 MHz y se activa el PLL para trabajar con el procesador a 100 MHz
	gpio_Init();				//Configura PH1 (Led en la tarjeta nucleo
	tim11_led_ok_Init();		//Configura TIM11: evento de actualización cada 250 ms

	adc_Init();					//Configura PA5 y PA6 para ADC de 12 bits en modo escaneo de 2 canales
	i2c1_display_Init();		//Configura los pines PB8 (SCL) y PB9 (SDA) para I2C1 a una velocidad estándar de 100 kHz
	LCD_Init();					//Ejecuta la secuencia de comandos por I2C inicializar el controlador HD44780 (siguiendo al datasheet)
	usart2_Init();				//Configura USART2 a 19200 bps (8N1) en modo asíncrono (UART) para transmisión (PA2) y recepción (PA3)
	rtc_Init();					//Asigna el cristal LSE (32.768 kHz) como fuente del RTC
	rtc_Initial_Setting();		//Configura la fecha y hora (lee el registro de Backup si está VBAT conectado)
	mco1_Init();				//Habilita el pin PA8 para monitorear los relojes del sistema en osciloscopio

	/*Transmisión del mensaje inicial (Instrucción con los caracteres específicos a usar)*/
	HAL_UART_Transmit(&huart2, (uint8_t *) init_Msg, strlen((char *) init_Msg), 300);

	/*Inicialización del ADC1*/
	HAL_ADC_Start_IT(&hadc1);

	update_display_flag = 1;		//Fuerza la primera actualización del LCD para que la pantalla no quede en blanco

	last_adc = HAL_GetTick();		//Comienza el conteo para empezar a medir el intervalo de muestreo del Joystick

	while(1){

		switch(estado_actual){

		case STATE_IDLE:

			if(usart_done == 1){					//Verifica si llegó un nuevo carácter por recepción

		        estado_actual = STATE_READ_DATA;

		    }

			else if(HAL_GetTick() - last_adc >= 250){		//Verifica si cumplió el conteo para el muestreo del Joystick

				last_adc = HAL_GetTick();					//Vuelve a comenzar el conteo

				HAL_ADC_Start_IT(&hadc1);					//Reinicializa la conversión ADC

			}


			else if(adc_done == 1){						//Verifica si el ADC terminó una conversión controlada por el software (ambos canales)

				estado_actual = STATE_READ_DATA;

			}

			break;

		case STATE_READ_DATA:

			if(usart_done == 1){

				command_process();		//Ejecuta las modificaciones según el caracter que se haya recibido

				usart_done = 0;             //Se baja la bandera
				update_display_flag = 1;    //Se alza la bandera para la actualización de la pantalla

				HAL_UART_Receive_IT(&huart2, (uint8_t *) &rx_data, 1);		//Reactiva la interrupción de recepción UART para el siguiente byte

			}

			if(adc_done == 1){

				if(adc_process() == 1){			//Hay un cambio significativo en la conversión ADC

					update_display_flag = 1; 	//Se alza la bandera para la actualización de la pantalla

				}

				adc_done = 0;		//Se baja la bandera

			}

			if(rtc_process() == 1){			//Hay un cambio en la hora

				update_display_flag = 1;    //Se alza la bandera para la actualización de la pantalla

			}

			if(update_display_flag == 1){

				estado_actual = STATE_UPDATE_DISPLAY;

			}

			else{		//No hay cambios que necesiten una actualización en la pantalla

				estado_actual = STATE_IDLE;

			}

			break;

		case STATE_UPDATE_DISPLAY:

			update_data();		//Se transmite a la pantalla por I2C la nueva información

			update_display_flag = 0;		//Se baja la bandera

			estado_actual = STATE_IDLE;

			break;

		}

	}

}


/*Funciones privadas*/

/*
 * SystemClock_Config
 * Usa el oscilador interno HSI a 16 MHz
 * Se configura el PLL a 100 MHz
 */
static void SystemClock_Config(void){

	/*Inicialización de estructuras*/
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /*Habilitar el reloj del periferico de power control*/
    __HAL_RCC_PWR_CLK_ENABLE();

	/*Subir el regulador a Scale 1 (Condición para que la frecuencia del HCLK máxima sea 100 MHz según el datasheet)*/
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/*Habilitar acceso al dominio de backup (requerido para tocar el LSE y el RTC)*/
	HAL_PWR_EnableBkUpAccess();

    /*HSI ya está encendido al resetear (Confirmar y usarlo) y del LSE para ser usado en MCO1 y el RTC*/
    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI |		//Oscilador Interno de Alta Velocidad (HSI)
    										RCC_OSCILLATORTYPE_LSE;			//Oscilador Externo de Baja Velocidad (LSE)
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;						//Encendido del HSI
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;		//Calibración por defecto de fábrica para el HSI
    RCC_OscInitStruct.LSEState  	 	  = RCC_LSE_ON;						//Encendido del LSE

    /*Configuración del PLL a 100 MHz*/
    RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;				//Activación del PLL
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;		//Selecciona el HSI como fuente para el PLL
	RCC_OscInitStruct.PLL.PLLM      = 16;						//Divisor en 16 = 1 MHz
	RCC_OscInitStruct.PLL.PLLN      = 200;						//Multiplicador en 200 = 200 MHz
	RCC_OscInitStruct.PLL.PLLP      = RCC_PLLP_DIV2;			//Divisor en 2 = 100 MHz

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /*Seleccionar PLL como SYSCLK*/
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK |		//Configuración simultánea de los relojes
                                       RCC_CLOCKTYPE_HCLK   |
                                       RCC_CLOCKTYPE_PCLK1  |
                                       RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;		//Reloj del sistema (SYSCLK) = 100 MHz
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;   			//Divisor del AHB (HCLK) en 1 = 100 MHz
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;     			//Divisor del APB1 (PCLK1) en 2 = 50 MHz
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     			//Divisor del APB2 (PCLK2) en 1 = 100 MHz

    /*FLASH_LATENCY_3 = three wait states, correcto para 100 MHz*/
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);

