sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
}


/*
 * gpio_Init
 * Configura PH1 como salida Push-Pull (Led D2 de la tarjeta nucleo)
 */
static void gpio_Init(void){


	/*Inicialización de estructuras*/
    GPIO_InitTypeDef GPIO_InitStruct = {0};

	/*Habilitar reloj de GPIOH en el bus AHB1*/
	__HAL_RCC_GPIOH_CLK_ENABLE();

    /*Configuración PH1*/
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;		//Establece el pin en modo salida Push-Pull
    GPIO_InitStruct.Pull  = GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;		//Configuración de velocidad como baja

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

}


/*
 * tim11_led_ok_Init
 * Configura TIM11 para generar un evento de actualización cada 250 ms
 */
static void tim11_led_ok_Init(void){

	/*Configuración del TIM11*/
	/*Habilitar reloj de TIM11 en el bus APB2*/
	__HAL_RCC_TIM11_CLK_ENABLE();

	/*Configuración general del TIM11*/
	htim11.Instance				  = TIM11;
	htim11.Init.Prescaler		  = 50000 - 1;							//Configurando el Prescaler a 0.5 ms (100 MHz / 50 kHz = 2 kHz)
	htim11.Init.CounterMode 	  = TIM_COUNTERMODE_UP;					//Conteo ascendente
	htim11.Init.Period 			  = 500 - 1;							//Periodo de 0.5 ms * 500 = 250 ms
	htim11.Init.ClockDivision 	  = TIM_CLOCKDIVISION_DIV1;				//División en 1 = 250 ms
	htim11.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;		//Deshabilita la precarga automática

	/*Cargando la configuración en los registros FSR del MCU*/
	HAL_TIM_Base_Init(&htim11);

	/*Registrando la interrupción en el NVIC para la recepción*/
	HAL_NVIC_EnableIRQ(TIM1_TRG_COM_TIM11_IRQn);

	/*Inicialización del TIM11 en modo de interrupción Update Event Interrupt (UEI)*/
	HAL_TIM_Base_Start_IT(&htim11);

}


/*
 * adc_Init
 * Configuración del ADC para PA5(CH5) y PA6(CH6)
 */
static void adc_Init(void){

	/*Configuración de PA5 y PA6*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_adc_ch5_ch6 = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general del pin*/
	GPIO_Init_adc_ch5_ch6.Pin  = GPIO_PIN_5 |
								 GPIO_PIN_6;
	GPIO_Init_adc_ch5_ch6.Mode = GPIO_MODE_ANALOG;		//Configura el pin en modo analógico
	GPIO_Init_adc_ch5_ch6.Pull = GPIO_NOPULL;			//Desactiva resistencias de Pull-Up o Pull-Down

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_Init_adc_ch5_ch6);

	/*Configuración del ADC*/
	/*Habilitar reloj de ADC en el bus APB2*/
	__HAL_RCC_ADC1_CLK_ENABLE();

	/*Configuración general del ADC*/
	hadc1.Instance					 = ADC1;
	hadc1.Init.ClockPrescaler		 = ADC_CLOCK_SYNC_PCLK_DIV8;		//División 8: 100 MHz / 8 = 12.5 MHz
	hadc1.Init.Resolution			 = ADC_RESOLUTION_12B;				//Resolución 12 bit (4096 divisiones)
	hadc1.Init.DataAlign			 = ADC_DATAALIGN_RIGHT;
	hadc1.Init.ScanConvMode			 = ENABLE;							//Habilitado por el eso de más de un solo canal de conversión ADC
	hadc1.Init.EOCSelection			 = ADC_EOC_SINGLE_CONV;				//Conversión finaliza al terminal el canal
	hadc1.Init.ContinuousConvMode	 = DISABLE;
	hadc1.Init.NbrOfConversion 		 = 2;								//Hay dos canales haciendo conversión ADC
	hadc1.Init.DiscontinuousConvMode = DISABLE;
	hadc1.Init.ExternalTrigConv		 = ADC_SOFTWARE_START;
	hadc1.Init.DMAContinuousRequests = DISABLE;

	/*Cargar la configuracion en los registros FSR del MCU */
	HAL_ADC_Init(&hadc1);

	/*Configuración de los canales 5 y 6*/
	/*Inicialización de estructuras*/
	ADC_ChannelConfTypeDef adc_ch5 = {0};
	ADC_ChannelConfTypeDef adc_ch6 = {0};

	/*Configuración general del canal 5*/
	adc_ch5.Channel		 = ADC_CHANNEL_5;
	adc_ch5.Rank		 = 1;							//Primera  conversión a hacer
	adc_ch5.SamplingTime = ADC_SAMPLETIME_84CYCLES;		//Cantidad de ciclos a pasar para hacer el muestreo (carga del capacitor)
	adc_ch5.Offset		 = 0;

	/*Configuración general del canal 6*/
	adc_ch6.Channel		 = ADC_CHANNEL_6;
	adc_ch6.Rank		 = 2;							//Segunda conversión a hacer
	adc_ch6.SamplingTime = ADC_SAMPLETIME_84CYCLES;		//Cantidad de ciclos a pasar para hacer el muestreo (carga del capacitor)
	adc_ch6.Offset		 = 0;

	/*Cargar las configuraciones en los registros FSR del MCU */
	HAL_ADC_ConfigChannel(&hadc1, &adc_ch5);
	HAL_ADC_ConfigChannel(&hadc1, &adc_ch6);

	/*Registrar la interrupción en el NVIC*/
	HAL_NVIC_EnableIRQ(ADC_IRQn);

}


/*
 * adc_process
 * Compara las lecturas actuales del ADC con las anteriores
 * Analiza los cambios calculados para decidir si son ruido o no
 */
static uint8_t adc_process(void){

	int diff_x = abs(raw_adc_x - actual_x);
	int diff_y = abs(raw_adc_y - actual_y);

	if(diff_x > 120 || diff_y > 120){			//Se verifica que si haya una diferencia mayor al 3% (120 unidades)

		actual_x = raw_adc_x;		//Se sobreescriben los valores para la próxima comparación
		actual_y = raw_adc_y;

		return 1;		//Hay un cambio significativo

	}

	else{

		return 0;		//Se descarta el cambio (ruido)

	}

}


/*
 * i2c1_display_Init
 * Configura los pines PB8 (SCL) y PB9 (SDA) para el uso de I2C del display
 */
static void i2c1_display_Init(void){

	/*Configuración de pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_display = {0};

	/*Habilitar reloj de GPIOB en el bus AHB1*/
	__HAL_RCC_GPIOB_CLK_ENABLE();

	/*Configuración general de los pines: PB8 y PB9*/
	GPIO_Init_display.Pin		= GPIO_PIN_8 |
								  GPIO_PIN_9;
	GPIO_Init_display.Mode 	 	= GPIO_MODE_AF_OD;					//Establece los pines en modo alternativo Open-Drain (Requerido para I2C)
	GPIO_Init_display.Pull	 	= GPIO_PULLUP;						//Activa resisetncia Pull-Up interna para evitar estados flotantes
	GPIO_Init_display.Speed	 	= GPIO_SPEED_FREQ_VERY_HIGH;		//Configuración de velocidad muy alta para flancos de subida y bajada limpios
	GPIO_Init_display.Alternate = GPIO_AF4_I2C1;					//Función alternativa correspondiente a AF4 en I2C1

    /*Cargar la configuracion en los registros FSR del MCU*/
    HAL_GPIO_Init(GPIOB, &GPIO_Init_display);

    /*Configuración de SCL y SDA en I2C1*/
	/*Habilitar reloj de I2C1 en el bus APB1*/
	__HAL_RCC_I2C1_CLK_ENABLE();

    /*Configuración general del I2C1*/
	hi2c1.Instance	   		   = I2C1;
	hi2c1.Init.ClockSpeed	   = 100000;						//Velocidad de transmisión estándar a 100 kHz (Standard Mode)
	hi2c1.Init.DutyCycle	   = I2C_DUTYCYCLE_2;				//Relación de ciclo de trabajo 2:1 (1/3 en alto y 2/3 en bajo)
	hi2c1.Init.OwnAddress1	   = 0;								//Dirección propia del microcontrolador (Es 0 actuando como maestro)
	hi2c1.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;		//Direcciones del bus de 7 bits
	hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;		//Desactiva direccionamiento dual
	hi2c1.Init.OwnAddress2	   = 0;
	hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;		//Desactiva el broadcast (Llamada general)
	hi2c1.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;			//Permite Clock Stretching (Estiramiento del reloj) para dar tiempo de procesamiento al sensor

	/*Inicialización del I2C*/
	HAL_I2C_Init(&hi2c1);

