sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
}


/*
 * command_process
 * Evalúa el caracter recibido, ejecuta la acción correspondiente
 */
static void command_process(void){

    switch(rx_data){

        case 'H':

            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);		//HSI: 16 MHz (divisor 1)

            mco_actual = "HSI";		//Actualiza en la pantalla cual señal de reloj hay en la salida del PA8

            break;

        case 'L':

            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_LSE, RCC_MCODIV_1);		//LSE: 32 kHz (divisor 1)

            mco_actual = "LSE";		//Actualiza en la pantalla cual señal de reloj hay en la salida del PA8

            break;

        case 'P':

            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_4);		//PLL: 100 MHz (divisor 4 = 25 MHz)

            mco_actual = "PLL";		//Actualiza en la pantalla cual señal de reloj hay en la salida del PA8

            break;

        case 'F':

            rtc_formato ^= 1;		//Alterna entre 0 y 1 (cambio de 24h a 12h o viceversa)

            break;

        case 'J':

            joystick_formato ^= 1;		//Alterna entre 0 y 1 (cambio de valor en V a normalizado o viceversa)

            break;

    }

}


/*
 * rtc_Init
 * Configura el RTC interno usando el LSE (32.768 kHz) como fuente de reloj
 * Prescalers calculados para llegar a 1 Hz
 */
static void rtc_Init(void){

	/*Seleccionar LSE como fuente de reloj del RTC*/
	__HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_LSE);

	/*Habilitar reloj de RTC en el bus APB1*/
	__HAL_RCC_RTC_ENABLE();

	/*Configuracion general del RTC*/
	hrtc.Instance            = RTC;
	hrtc.Init.HourFormat     = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv   = 128 - 1;							//Divisor asincrono: 32768 Hz / 128 = 256 Hz
	hrtc.Init.SynchPrediv    = 256 - 1;							//Divisor sincrono: 256 Hz / 256 = 1 Hz
	hrtc.Init.OutPut         = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;

	/*Inicializacion*/
	HAL_RTC_Init(&hrtc);

}


/*
 * rtc_Set
 * Configura hora y fecha solamente la primera vez que arranca el RTC
 * Se usa un registro de backup alimentado por la bateria conectada a VBAT
 * Debe tenerse en cuenta la "contraseña" para la inicialización del RTC
 */
static void rtc_Initial_Setting(void){

	/*Inicialización de estructuras*/
	RTC_TimeTypeDef RTC_Time = {0};
	RTC_DateTypeDef RTC_Date = {0};

	/*Verificar si el RTC ya fue inicializado antes*/
	if(HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != RTC_BACKUP_PSW){		//Si la contraseña es la misma sigue contando normalmente, de lo contrario se inicializa nuevamente

		/*Configuración inicial de la hora, se usa como referencia*/
		RTC_Time.Hours   = 19;
		RTC_Time.Minutes = 0;
		RTC_Time.Seconds = 0;

		/*Cargando la configuración en los registros FSR del MCU*/
		HAL_RTC_SetTime(&hrtc, &RTC_Time, RTC_FORMAT_BIN);

		/*Configuración inicial de la fecha, se usa como referencia*/
		RTC_Date.WeekDay = RTC_WEEKDAY_MONDAY;
		RTC_Date.Month   = RTC_MONTH_JULY;
		RTC_Date.Date    = 27;
		RTC_Date.Year    = 26;

		/*Cargando la configuración en los registros FSR del MCU*/
		HAL_RTC_SetDate(&hrtc, &RTC_Date, RTC_FORMAT_BIN);

		/*Se guarda en el registro de backup la contraseña*/
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, RTC_BACKUP_PSW);

	}

}


/*
 * rtc_process
 * Retorna 1 si cambió el segundo, 0 si no.
 */
static uint8_t rtc_process(void){

	/*Lectura de los registros con fecha y hora*/
    HAL_RTC_GetTime(&hrtc, &hora_actual, RTC_FORMAT_BIN);		//Al leerse se bloquean los registros
    HAL_RTC_GetDate(&hrtc, &fecha_actual, RTC_FORMAT_BIN);		//Llamar la fecha inmediatamnte desbloquea la hora

    if(hora_actual.Seconds != rtc_ultimo_segundo){		//Compara la hora actual

        rtc_ultimo_segundo = hora_actual.Seconds;		//Reescribe el valor para la próxima comparación

        sprintf(lcd_linea0, "Fecha:%02d/%02d/%02d", fecha_actual.Date, fecha_actual.Month, fecha_actual.Year);		//Reescribe la información el buffer de la línea 0

        if(rtc_formato == 0){		//Formato de 24h (no se cambia nada)

            sprintf(lcd_linea1, "Hora:%02d:%02d:%02d   ", hora_actual.Hours, hora_actual.Minutes, hora_actual.Seconds);		//Reescribe la información el buffer de la línea 1

        }

        else{		//Formato de 12h

            uint8_t h_12 = hora_actual.Hours;
            char* am_pm;

            if (hora_actual.Hours >= 12) {		//Horas de la tarde

                am_pm = "PM";

                if (hora_actual.Hours == 12) {		//Medio día (no cambia)

                    h_12 = 12;

                }

                else {

                    h_12 = hora_actual.Hours - 12;		//Se restan las 12 horas para el formato

                }

            }

            else {		//Horas de la mañana

                am_pm = "AM";

                if (hora_actual.Hours == 0) {

                    h_12 = 12;		//Media noche

                }

                else {

                    h_12 = hora_actual.Hours;		//No se cambian

                }

            }


            sprintf(lcd_linea1, "Hora:%02d:%02d:%02d %s", h_12, hora_actual.Minutes, hora_actual.Seconds, am_pm);		//Reescribe la información el buffer de la línea 1

        }

        return 1;		//Hay un cambio

    }

    else {

        return 0; 		//Sigue en el mismo segundo

    }

}


/*
 * update_data
 * Toma los 4 buffers de linea armados en el main, actualiza el display y el mensaje de comincación serial
 */
static void update_data(void){

	char valor_x[16];
	char valor_y[16];

	if(joystick_formato == 0){		//FOrmato en V

		float v_x = ((3.3f / 4095.0f) * (float) raw_adc_x);		//Conversión del valor raw adc de X en un valor de V
		float v_y = ((3.3f / 4095.0f) * (float) raw_adc_y);		//Conversión del valor raw adc de Y en un valor de V

		/*Reescribiendo los valores con un decimal*/
		sprintf(valor_x,"%.1f V", v_x);
		sprintf(valor_y,"%.1f V", v_y);

		sprintf(lcd_linea2, "X:%3.1f V Y:%3.1f V", v_x, v_y);		//Reescribe la información el buffer de la línea 2

