sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
	}

	else{

		float norm_x = ((float) raw_adc_x - 2048.0f) / 2048.0f;		//Conversión del valor raw adc de X normalizado
		float norm_y = ((float) raw_adc_y - 2048.0f) / 2048.0f;		//Conversión del valor raw adc de Y normalizado

		/*Reescribiendo los valores con dos decimales*/
		sprintf(valor_x,"%.2f", norm_x);
		sprintf(valor_y,"%.2f", norm_y);

		sprintf(lcd_linea2, "X:%5.2f Y:%5.2f", norm_x, norm_y);		//Reescribe la información el buffer de la línea 2

	}

	sprintf(lcd_linea3, "MCO1:%s", mco_actual);		//Reescribe la información el buffer de la línea 3

	/*Actualización de la pantalla LCD*/
	LCD_Refresh();

	/*Mensaje a enviar después de reconocer cambios y actualizarse los datos*/
	sprintf((char*) msg_buffer,
	"---------------------\r\n"
	" Datos actuales\r\n"
	"  X = %s\r\n"
	"  Y = %s\r\n"
	"  MCO1 = %s\r\n"
	"----------------------\r\n"
	"\r\n", valor_x, valor_y, mco_actual);

	/*Transmisión del mensaje*/
	HAL_UART_Transmit(&huart2, msg_buffer, strlen((char*) msg_buffer), 100);

}


/*
 * mco1_Init
 * Configura el MCO1 como salida para leer el HSI, LSE o PLL (Según se requiera) en PA8
 */
static void mco1_Init(void){

	/*Configuración de los pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_mco1_Init = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA8*/
	GPIO_mco1_Init.Pin	     = GPIO_PIN_8;
	GPIO_mco1_Init.Mode 	 = GPIO_MODE_AF_PP;					//Establece los pines en modo función alternativa
	GPIO_mco1_Init.Pull  	 = GPIO_NOPULL;						//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_mco1_Init.Speed	 = GPIO_SPEED_FREQ_VERY_HIGH;		//Configuración de velocidad como muy alta para evitar distorsiones
	GPIO_mco1_Init.Alternate = GPIO_AF0_MCO;					//Función alternativa correspondiente a AF0 en MCO1

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_mco1_Init);

	/*Inicialización del MCO1*/
	HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);		//Se redirige la señal del Oscilador Interno de Alta Velocidad (HSI) a PA8, de forma inicial

}


/*
 * HAL_TIM_PeriodElapsedCallback
 * Llamado automáticamente por HAL_TIM_IRQHandler() cada vez que un evento de actualización del timer se dispara
 * Es compartido por todos los timers (Siempre verifica htim->Instance)
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){

    if(htim->Instance == TIM11){

        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);

    }
}


/*
 * HAL_ADC_ConvCpltCallback
 * Callback de la conversión ADC
 * Usa una variable para seguir las secuencias de los canales convertidos almacenando cada valor donde corresponde
 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){

	if(hadc->Instance == ADC1){

		if(adc_secuence == 0){						//Conversión de X

			raw_adc_x = HAL_ADC_GetValue(hadc);

			adc_secuence = 1;

		}

		else{										//Conversión de Y

			raw_adc_y = HAL_ADC_GetValue(hadc);

			adc_secuence = 0;

			adc_done = 1;

		}

	}

}


/*
 * HAL_UART_RxCpltCallback
 * Callback de la recepción USART
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){

    if (huart->Instance == USART2){

        usart_done = 1;

    }

}




